----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kwj/SkyDrive/cloud/计量经济学/Stata/p34.log
  log type:  text
 opened on:  19 Mar 2021, 17:03:19

.                         
. use p34.dta, clear

. sum                     

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |         10        2150    908.2951        800       3500
           y |         10      1582.9    610.5512        638       2530

. scatter y x

. reg y x

      Source |       SS           df       MS      Number of obs   =        10
-------------+----------------------------------   F(1, 8)         =   1219.10
       Model |   3333082.5         1   3333082.5   Prob > F        =    0.0000
    Residual |     21872.4         8     2734.05   R-squared       =    0.9935
-------------+----------------------------------   Adj R-squared   =    0.9927
       Total |   3354954.9         9  372772.767   Root MSE        =    52.288

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |        .67   .0191891    34.92   0.000     .6257498    .7142502
       _cons |      142.4   44.44673     3.20   0.013     39.90565    244.8944
------------------------------------------------------------------------------

. twoway (scatter y x)(lfit y x)  //散点图上同时画出回归直线                          

. twoway   (scatter y x)      /*
>       */ (lfit    y x),     /*
>       */ title("散点图和线性拟合图")  

. graph save p34.gph, replace
(file p34.gph saved)

. 
. **计算被解释变量的拟合值，并将其记为y_hat
. predict y_hat                           
(option xb assumed; fitted values)

. **计算“残差”(residual)，并将其记为 e
. predict e,r  //选择项“residual”(r)表示预测残差,其他如xb等

.               //如果没有选择项，“默认值”(default)计算拟合值(xb)                             
. list

     +------------------------------+
     |    x      y    y_hat       e |
     |------------------------------|
  1. |  800    638    678.4   -40.4 |
  2. | 1100    935    879.4    55.6 |
  3. | 1400   1155   1080.4    74.6 |
  4. | 1700   1254   1281.4   -27.4 |
  5. | 2000   1408   1482.4   -74.4 |
     |------------------------------|
  6. | 2300   1650   1683.4   -33.4 |
  7. | 2600   1925   1884.4    40.6 |
  8. | 2900   2068   2085.4   -17.4 |
  9. | 3200   2266   2286.4   -20.4 |
 10. | 3500   2530   2487.4    42.6 |
     +------------------------------+

. format y_hat  %6.2f

. format e  %8.3f                         

. list

     +---------------------------------+
     |    x      y     y_hat         e |
     |---------------------------------|
  1. |  800    638    678.40   -40.400 |
  2. | 1100    935    879.40    55.600 |
  3. | 1400   1155   1080.40    74.600 |
  4. | 1700   1254   1281.40   -27.400 |
  5. | 2000   1408   1482.40   -74.400 |
     |---------------------------------|
  6. | 2300   1650   1683.40   -33.400 |
  7. | 2600   1925   1884.40    40.600 |
  8. | 2900   2068   2085.40   -17.400 |
  9. | 3200   2266   2286.40   -20.400 |
 10. | 3500   2530   2487.40    42.600 |
     +---------------------------------+

. **显示估计系数的协方差矩阵
. vce  //“vce”表示“variance covariance matrix estimated”

Covariance matrix of coefficients of regress model

        e(V) |          x       _cons 
-------------+------------------------
           x |  .00036822             
       _cons | -.79167778   1975.5122 

. **显示回归结果
. ereturn list

scalars:
               e(rank) =  2
               e(ll_0) =  -77.80620429544956
                 e(ll) =  -52.64136410217095
               e(r2_a) =  .9926656391118701
                e(rss) =  21872.40000000002
                e(mss) =  3333082.5
               e(rmse) =  52.28814397165004
                 e(r2) =  .9934805680994401
                  e(F) =  1219.100784550391
               e(df_r) =  8
               e(df_m) =  1
                  e(N) =  10

macros:
            e(cmdline) : "regress y x"
              e(title) : "Linear regression"
          e(marginsok) : "XB default"
                e(vce) : "ols"
             e(depvar) : "y"
                e(cmd) : "regress"
         e(properties) : "b V"
            e(predict) : "regres_p"
              e(model) : "ols"
          e(estat_cmd) : "regress_estat"

matrices:
                  e(b) :  1 x 2
                  e(V) :  2 x 2

functions:
             e(sample)   

. 
. reg y x, level(99)

      Source |       SS           df       MS      Number of obs   =        10
-------------+----------------------------------   F(1, 8)         =   1219.10
       Model |   3333082.5         1   3333082.5   Prob > F        =    0.0000
    Residual |     21872.4         8     2734.05   R-squared       =    0.9935
-------------+----------------------------------   Adj R-squared   =    0.9927
       Total |   3354954.9         9  372772.767   Root MSE        =    52.288

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [99% Conf. Interval]
-------------+----------------------------------------------------------------
           x |        .67   .0191891    34.92   0.000     .6056131    .7343869
       _cons |      142.4   44.44673     3.20   0.013     -6.73601     291.536
------------------------------------------------------------------------------

. 
. clear

. 
end of do-file

. exit
